app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN (NULL)) ORDER BY release_date
---
  def index
    @movies = Movie.order(params[:sort])